import numpy as np
import cv2

#双目相机参数
class stereoCameral(object):
    def __init__(self):

        #左相机内参数
        self.cam_matrix_left = np.array([[517.73610256, 0., 359.68192807],
                               [0., 503.18730169, 227.19967664],
                               [0., 0., 1.]])
        #右相机内参数
        self.cam_matrix_right = np.array([[572.08224964, 0., 345.11181113],
                                [0., 545.096531, 188.08904018],
                                [0., 0., 1.]])

        #左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[-0.29337933, -0.41057414, -0.0052619, -0.01017261, 1.01789224]])
        self.distortion_r = np.array([[-0.41458153, 0.09833357, 0.01798432, -0.00493075, 0.05291643]])

        # #旋转矩阵
        # om = np.array([-0.00320, -0.00163, -0.00069])
        # self.R = cv2.Rodrigues(om)[0]  # 使用Rodrigues变换将om变换为R
        self.R = np.array([[0.99885449, -0.00103767, -0.04783961],
              [0.00305682, 0.9991065, 0.0421528 ],
              [0.04775312, -0.04225075, 0.99796519]])

        #平移矩阵
        self.T = np.array([[-1.1257236],
              [0.05906977],
              [-0.88203856]])