import numpy as np

'''
    相机内参    
'''

class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[540.14677906, 0., 358.66165365],
                                         [0., 520.97396263, 223.01354049],
                                         [0., 0., 1.]])
        # 右相机内参
        self.cam_matrix_right = np.array([[545.53797161, 0., 348.06279318],
                                          [0., 521.85033766, 209.49784834],
                                          [0., 0., 1.]])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[-0.37665241, -0.31896596, 0.01202205, -0.0054201, 1.28103253]])
        self.distortion_r = np.array([[-0.37665241, -0.31896596, 0.01202205, -0.0054201, 1.28103253]])

        # 旋转矩阵
        self.R = np.array([[0.73286817, 0.06989345, 0.67677113],
                           [0.03403944, 0.9896971, -0.13907178],
                           [-0.67951863, 0.12495818, 0.72293837]])

        # 平移矩阵
        self.T = np.array([[-4.04842304],
                           [1.40342701],
                           [-2.69444571]])

        # 焦距
        self.focal_length = 521.4121501449999  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]

        # 基线距离
        self.baseline = 4.04842304  # 单位：mm， 为平移向量的第一个参数（取绝对值）
